[
  {
    "path": "posts/2021-01-26-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "A makeover of the data visualisation on Resident Labour Force. The original data visualisation can be found on Page 22 of Report: Labour Force in Singapore 2019 (https://stats.mom.gov.sg/Pages/Labour-Force-In-Singapore-2019.aspx).",
    "author": [
      {
        "name": "Selene Choong",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\r\n1.0 Critiques of Existing Visualisation with Suggested Improvements\r\n\r\n\r\n\r\nClarity\r\nS/N\r\nComments\r\nSuggested Improvement\r\n1\r\nLead-in paragraph is informative and discusses about both the change in the Labour Force Participation Rate (LFPR) and in the share of the resident labour force by age groups from 2009 to 2019. However, the current chart only shows the share of the resident labour force by age groups. No data is shown to depict the change in the LFPR, which might confuse the readers on the data being referenced in the analysis.\r\nInclude another additional chart that shows the corresponding LFPR by age bands for 2009 and 2019\r\n2\r\nLead-in paragraph cites the percentages as the sum of broader age bands (e.g. aged 25 to 54 instead of the 5-year age band of 25-29, 30-34 to 50-54) making it difficult for the readers to relate the figures with the chart directly.\r\nAnnotate within the chart the total percentages across the age bands that were being mentioned in the lead-in paragraph so that readers can easily identify how the percentages cited were derived\r\n3\r\nTitle of the existing chart might be confusing as “Resident labour force by age” might be interpreted as the actual number of residents that are in the labour force for each age band but the current unit for the chart is in percent.\r\nRevise the chart title to “Share of Resident Labour Force by Age” to reflect that the figures shown are percentages and total across all age groups will sum to 100%\r\n4\r\nData are being represented in age bands on the x-axis. Using line chart makes it difficult for readers to identify the corresponding points for age group on the x-axis. Also, the use of line chart might mislead the reader to interpret the data as being time-series data. Line charts are not advisable to be used for comparison of categorical data.\r\nRevise the chart to represent each age band as a bar chart (horizontal/ vertical) to clearly show that age is being charted as discrete categorical bands instead of continuous age value\r\n5\r\nWhile having the reference line for the median age is useful for comparing between the 2 years, charting it on the x-axis which is shown in terms of age bands is confusing.\r\nKeep the median age comparison but as a separate chart instead of reference levels\r\nAesthetics\r\nS/N\r\nComments\r\nSuggested Improvement\r\n6\r\nChoice of font, font size and layout is generally clear with the title of the chart at the top left corner of the chart. Labels on x-axis are clearly displayed horizontally.\r\nCan keep to the existing font, font size and layout\r\n7\r\nThe use of colour coding (grey for 2009 and blue for 2019) helps readers to easily distinguish the data between the 2 years. The more recent year of 2019 also stands out since the blue colour used is brighter.\r\nTwo distinct colours can still be used for each year to distinguish between them\r\n8\r\nThere is currently no y-axis and no indication of the data units being shown in the line chart. It might not be clear to the readers what data are being represented by the 2 lines in the chart.\r\nAdd the necessary labelling for the axis to allow readers to clearly identify the data that is being charted\r\n2.0 Ways to Improve Current Visualisation\r\nSketch of Proposed Design\r\n\r\n\r\n\r\nThe usage of bar charts instead of line charts can better represent the data which was grouped into categorical age bands. Presentation of the data in sequential age bands of around 5 years was kept which allows readers to see the differences across the age groups on a more detailed level.\r\nAddition of the chart on the Labour Force Participation Rate (LFPR) as well as the net percentages across age bands for the share of Labour Force allows for consistency in the information described in the lead-in paragraph and the charts, where readers can easily identify the source of the data in the visualisation.\r\nHaving the two charts with the corresponding age bands side-by-side allows the readers to easily see how the share and the LFPR has changed for each age band and compare across the age bands.\r\nSeparating the median age from the chart also prevents confusion since the age data was not being shown as a continuous variable.\r\n3.0 Step-by-step Description on Preparation\r\nS/N\r\nInterface\r\nStep\r\nAction\r\n1\r\nExcel Tables\r\nData preparation - Extract relevant data and format into proper structure\r\nPerform the following steps for Table 5 and Table 7:  • Extract data from the Total tab, keeping only column data for 2009 and 2019 as well as row data for the header and the individual age bands (i.e. rows 5, 7 to 18)  • Format the structure to remove all the leading empty rows (i.e. header to start at row 1) and all the empty columns so that the data is in the correct format for importing into Tableau  Save the extracted data into a new excel file with one table on each worksheet tab\r\n2\r\nExcel Tables\r\nData preparation - Format row labels\r\nRemove the extra white spaces in the age labels (e.g. from “15 - 19” to “15 - 19”)\r\n3\r\nData Source\r\nImport data into Tableau\r\n• Under Connect to a File, click Microsoft Excel and select the relevant excel file from the correct directory  • Relate Table 5 and Table 7 using the common variable of Age (Years) \r\n4\r\nSheet 1 (LF_Share)\r\nCreate pyramid chart for Share of Resident Labour Force by Age\r\nDrag T7 Age under Rows, T7 2009 and T7 2019 under Columns \r\n5\r\nSheet 1 (LF_Share)\r\nConvert the measures into percent\r\nUse quick table calculations and convert both T7 2009 and T7 2019 to percent of total (i.e. value shown in the original chart)\r\n6\r\nSheet 1 (LF_Share)\r\nFormat the charts\r\n• Edit the x-axis of the 2009 chart and select “Reversed” to reverse the axis of the chart on the left  • Click on Label and select “Show marks labels” to add the chart labels for both 2009 and 2019 charts  • Format the measures to display them to 1 decimal place by changing the “Numbers” under Default section of the Pane tab to Percentages 1 decimal place  • Right click on the x-axis and select Edit Axis. Fix the range to have a consistent range for both left and right charts  • Colour code the 2 charts into 2 different colours by year using the Colour button under the Marks cart  • Remove the vertical gridlines under Format Lines by changing the “Grid Lines” of the Column tab to None  • Edit the Tooltip under the Marks cart for the label of the % to “% out of Total in [YYYY]” \r\n7\r\nSheet 1 (LF_Share)\r\nFormat the charts – Add the x-axis at the top of the chart\r\n• Drag another T7 2009 (after the current T7 2009) and T7 2019 (after the current T7 2019) under Columns  • Change the chart type back to Bar for all charts  • Use quick table calculations and convert the new T7 2009 and T7 2019 to percent of total  • For each of the new measure added, click on the arrow and select “Dual Axis” to merge the charts of the same measure as one  • Change the colour of the charts for the two new measures to Opacity = 0% under their corresponding Marks cart  • Right click on the x-axis at the top and select “Synchronize Axis”  • “Remove” the bottom x-axis for both charts by selecting Edit Axis then clear the Title text box under Titles and select None for both Major tick marks and Minor tick marks under the Tick Marks tab  • Change the top x-axis to show only the label of “% in June [YYYY]” by selecting Edit Axis then revise the Title text box under Titles and select None for both Major tick marks and Minor tick marks under the Tick Marks tab\r\n8\r\nSheet 1 (LF_Share)\r\nAdd chart title\r\nTitle of the chart was changed to “Share of Resident Labour Force by Age” with the unit of Per cent added below by clicking on the Title to edit\r\n9\r\nData Source\r\nTransform data into required format\r\n• Pivot the columns T5 2009 and T5 2019  • Rename “Pivot Field Names” to “Year”, “Pivot Field Values” to “LFPR”\r\n10\r\nSheet 2 (LFPR)\r\nCreate dumbbell chart for LFPR by Age\r\n• Drag T5 Age under Rows, LFPR under Columns and Year under Colour  • Change the mark type from Automatic to Circle  • Drag another LFPR under Columns and change the mark type to Line  • Remove Year from Colour and drag it to Path \r\n11\r\nSheet 2 (LFPR)\r\nFormat the chart\r\n• Right click on the second pill of LFPR and select “Dual Axis”  • Right click on one of the x-axis and select “Synchronise Axis”  • Swop the order of the two LFPR pills such that the line appears behind the dots  • Rename the bottom x-axis to “% LFPR”  • Hide the top x-axis by right clicking the x-axis and unselecting “Show Header”  • Colour code the dots for the 2 years into the 2 corresponding colours used in the previous chart in Sheet 1  • Increase the size of the dots and the thickness of the line \r\n12\r\nSheet 2 (LFPR)\r\nAdd Chart Title\r\nTitle of the chart was changed to “Resident Labour Force Participation Rate by Age” with the unit of Per cent added below by clicking on the Title to edit\r\n13\r\nSheet 3 (LF_Nett)\r\nCreate new calculated field with recoded age bands\r\nRecode the age into broader age bands using “Create Calculated Fields…” and input the details below \r\n14\r\nSheet 3 (LF_Nett)\r\nCreate table with Share of Resident Labour Force by broader age bands\r\n• Drag Age_Nett under Rows, Measure Names under Columns and Measure Values under Text  • Remove the irrelevant measures under Measure Values to keep only T7 2009 and T7 2019  • Use quick table calculations and convert both T7 2009 and T7 2019 under Measure Values to percent of total\r\n15\r\nSheet 3 (LF_Nett)\r\nFormat the table\r\n• Right click on the header and unselect “Show Header”  • Right click on the header of the rows and select “Hide Field Labels for Rows”  • Click on the arrow for each measure under Measure Values and format to display them to 1 decimal place by changing the “Numbers” under Default section of the Pane tab to Percentages 1 decimal place  • Right click on the table and add table border under the Format Border  • Rearrange the rows in ascending age order by dragging the rows to the correct position\r\n16\r\nDashboard\r\nCreate the Dashboard, Add Title and Format\r\n• Create a new dashboard sheet. Drag LF_Share and LFPR from the Sheets cart into the dashboard sheet to be displayed side by side. Drag LF_Nett under the LF_Share chart  • Select “Show Title” under Dashboard. Title of the dashboard was changed to “Increase in older residents in the labour force from 2009 to 2019”, with the year colour coded  • Add in a text box under the Title to add in the lead-in paragraph\r\n17\r\nDashboard\r\nFormat the Legend\r\n• Rearrange the legend to display it under the LFPR chart  • Right click on each legend and click “Edit Alias” to rename each legend label to “June [YYYY]”  • Click more options on the left of the Legend, select “Arrange items” and Single Row  • Add a Blank to the left of the Legend to right align the Legend relative to the LFPR chart\r\n18\r\nDashboard\r\nAdd in the median ages\r\n• Add in the median ages for 2009 and 2019 with the label of Median Age as separate text boxes under the LFPR_Nett table  • Colour code the median ages by the year\r\n19\r\nData Source\r\nPublish onto Tableau Public\r\nConvert the connection from Live to Extract to allow publishing to Tableau Public \r\n4.0 Final Data Visualisation Output\r\n\r\n\r\n\r\nLink to Tableau Dashboard: https://public.tableau.com/profile/selenechoong#!/vizhome/ISSS608_DataViz_Makeover_01/Dashboard\r\n5.0 Major Observations\r\nObservation 1:  Between 2009 to 2019, share of the middle-aged residents (aged 25 - 54) among the resident labour force has declined (75.3% in 2009 to 67.4% in 2019), despite the increase in Labour Force Participation Rate (LFPR) among these middle-aged residents.\r\n\r\n\r\n\r\nObservation 2:  While LFPR remained lower among older residents (aged 55 & over) as compared to the middle-aged residents (aged 25 - 54) in 2019, there was a larger increase in LFPR observed among these older residents between 2009 to 2019, particularly among those aged 60 to 69 with more than 10% point increase.\r\n\r\n\r\n\r\nObservation 3:  All age bands experienced a rise in the LFPR between 2009 to 2019, except for residents aged 20 to 24 where LFPR has declined from 63.5% to 61.0%.\r\n\r\n\r\n\r\nObservation 4:  Distribution of the resident labour force used to be more right skewed in 2009 (i.e. younger labour force) as compared to 2019, where the distribution of the resident labour force appears to be more symmetric. This is further supported by the increase in median age of the residents in the labour force.\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-26-dataviz-makeover-1/images/Fig1_ExistingViz.png",
    "last_modified": "2021-01-28T18:06:03+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Visual Analytics",
    "description": "Welcome to my blog documenting all my works for ISSS608 Visual Analytics \n& Applications. I hope you enjoy reading what I have created!",
    "author": [
      {
        "name": "Selene Choong",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-18",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-26T02:14:36+08:00",
    "input_file": "welcome.utf8.md"
  }
]
