[
  {
    "path": "posts/2021-02-12-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "A makeover of a data visualisation on the willingness of the public towards Covid-19 vaccination. Data was obtained from Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub hosted at Github (https://github.com/YouGov-Data/covid-19-tracker), with the focus on survey data collected in January 2021.",
    "author": [
      {
        "name": "Selene Choong",
        "url": "https://www.linkedin.com/in/selenechoong/"
      }
    ],
    "date": "2021-02-12",
    "categories": [],
    "contents": "\r\n1.0 Critiques of Existing Visualisation with Suggested Improvements\r\n\r\n\r\n\r\nClarity\r\nS/N\r\nComments\r\nSuggested Improvement\r\n1\r\nThe order of the countries on the y-axis for both charts are not synchronised, making it difficult for the readers to match the corresponding country bars between the two charts. However, the use of sorting for the chart “% of strongly agreed to vaccination” makes it easier for readers to view the relative results across the countries.\r\nAlign the country order such that the values for each country are shown on the same row. Countries can be sorted in decreasing % of respondents who selected strongly agreed\r\n2\r\nThe charts are showing the % of survey respondents who selected the respective response values. As the survey only polled a subset of the citizens within each country (i.e. sample) instead of all citizens (i.e. population), there would be some form of uncertainty associated with the values shown. However, the existing chart does not depict any uncertainty and readers might interpret the chart as showing the precise representation of the country’s true acceptance towards the vaccine.\r\nExplore using statistical values to reflect the uncertainty associated with the survey results\r\n3\r\nThe current chart title does not clearly describe the question being asked to capture the findings shown, which is only covering willingness to get the vaccine if available this week. Research also mainly utilised the survey data from interviews conducted in January 2021, but this timeframe was not shown in the data visualisation.\r\nRevise the chart title to better represent the question asked as well as to reflect the timeframe of January 2021 within the data visualisation\r\n4\r\nValue labels for the left chart were kept to the original data labels which only indicated the textual label for rating 1 and rating 5 and keeping ratings 2 to 4 as the numeric label only. This might not be intuitive to the readers on what each number represents.\r\nRecode the values to use textual labels instead (i.e. 1 as “Strongly agree”, 2 as “Agree”, 3 as “Neutral”, 4 as “Disagree” and 5 as “Strongly disagree”)\r\n5\r\nScale of the x-axis of the two charts are not synchronised, causing the bars of the right chart to appear longer than the same value on the left chart. This might be misleading to the readers.\r\nSynchronise the axis for all charts, particularly those that are side by side so that the scales of the charts are aligned\r\nAesthetics\r\nS/N\r\nComments\r\nSuggested Improvement\r\n6\r\nCurrent position of the legend makes it difficult for the readers to match the value with its corresponding colour. Also, the title of the legend is showing the variable name instead of a related name to the chart and might confuse readers on whether the legend is meant for the left chart.\r\nLegend should be shown near to the chart to allow easy matching of the values. Should legend title be required, it should be renamed to a related name to the chart\r\n7\r\nWhile the colour coding used for the chart on “Which country is more pro-vaccine” allows readers to distinctly identify the different categories, it does not depict the relativity of the labels that the finding is on a rating scale.\r\nRevise the colour to show “Strongly agree” and “Agree” to use the same colour of different gradation. Likewise, “Strongly disagree” and “Disagree” will be shown with the same colour of different gradation as well\r\n8\r\nCoordinated use of blue colour for “Strongly agree” across the two charts allows for readers to better infer that the right chart might be showing a related value to the blue bar within the stacked chart of the left chart.\r\nCoordinated use of colours can be adopted where applicable\r\n9\r\nInconsistent x-axis labels across the two charts, where the x-axis labels for the left chart is shown as whole number while the right chart us shown to 1 decimal place\r\nStandardise the number of decimal places across all the axis\r\n10\r\nCountry labels are currently shown in full lowercase and with hyphens in the positions of the spaces. This might not be the best way to depict the country names.\r\nChange the country names into proper case format and replace hyphens with space\r\n2.0 Ways to Improve Current Visualisation\r\nSketch of Proposed Design\r\n\r\n\r\n\r\nAdditional charts depicting data collected for other fields and the presence of on-demand parameters allow readers to deep dive further into the survey results, as well as to identify if there are any differences between the various segments instead of only comparing at the overall level.\r\nBar charts are kept to show the proportions of respondents within each country that have selected each of the response option. To further improve the ease of comparison, stacked bar charts are adopted that aligns the disagree vs agree.\r\nError bars are added to show the uncertainty associated with survey data, and the range of findings at the various confidence levels.\r\n3.0 Step-by-step Description on Preparation\r\n3.1 Data Source\r\nData used for this visualisation can be downloaded from Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub. While the entire data hosted on Github contains survey results for 30 countries, only the datasets for the following 14 countries were used: Australia, Canada, Denmark, Finland, France, Germany, Italy, Japan, Netherlands, Norway, Singapore, South Korea, Sweden and United Kingdom.\r\n3.2 Data Preparation\r\nData Inspection of the Data Files for 14 Countries\r\nInspecting the data showed that there are numerous other field columns that were not applicable for the research, as well as data rows that were out of the Jan 2021 timeframe of interest \r\nThe codebook showed that all the datasets have the same variable fields (i.e. same header)\r\nThere were some observed inconsistencies in the coding for some variables (e.g.  )\r\nConcatenating Multiple Datasets in Tableau\r\nLaunch Tableau. Under Connect to a File, click Text File \r\nNavigate to the file directory where the data is saved. Select the one of the country data files (e.g. australia)\r\nRemove the Logical Table of Australia from the Data Source Selection pane \r\nDouble click on New Union under the Files pane on the left \r\nIn the popup “Union” window, drag in the datasets for all 14 countries from the left pane and click OK to merge rows from all datasets into one \r\nFiltering Master Data to Keep Relevant Data\r\nClick on Sheet 1 to add a new worksheet \r\nDrag the dimensions and measures for all the data fields of interest (Vac 1, Vac2_1, Vac2_2, Vac2_3, Vac2_6, Vac_3, Gender, Age, Household Size, Household Children, Employment Status) as well as country (i.e. Table Name) under the rows. For employment status, include all the relevant dimensions i.e. Employment Status, Employment Status 1, Employment Status 2 etc. \r\nDrag [RecordNo] under Detail of the All Marks Pane to keep the data at the individual respondent record level \r\nDrag endtime under Filters cart and select range of dates, then indicate 1 Jan 2021 12AM as the start date and 31 Jan 2021 11.59PM as the end date to only keep data in Jan 2021 \r\nClick Analysis > View Data. In the popup “View Data” window, click the Export All button to save this filtered set of data as a new file (saved as consolidated_jan21 in this case) \r\nClose the current Tableau session\r\nData Cleaning for Extracted Data in Tableau\r\nLaunch a new Tableau session. Navigate to the directory on computer drive with the file “consolidated_jan2021” and drag the file into Tableau to connect the data\r\nClick on Sheet 1 to add a new worksheet \r\nSeveral new fields will be created to tidy up the existing data format. To create new field, click Analysis > Create Calculated Field. Rename the new field with text under “Field Name” column and input the formula under “Formula” column and click OK. Repeat this step for each of the new fields listed in the table below\r\nS/N\r\nField Name\r\nFormula\r\nPurpose\r\n1\r\nCountry\r\nREPLACE(REPLACE([Table Name], “.csv”, \"“),”-“,” \")\r\nRemove the file extension and replace hyphens with space in the Table Name field which contains the country labels\r\n2\r\nCountry Format\r\nTRIM(UPPER(LEFT(SPLIT([Country], \" “, 1), 1)) + MID(SPLIT([Country],” “, 1), 2) +” \" + UPPER(LEFT(SPLIT([Country], \" “, 2), 1)) + MID(SPLIT([Country],” \", 2), 2))\r\nProper case the country names i.e. capitalise the first letter of each word\r\n3\r\nAge Band\r\nIF [Age] <= 29 THEN “18 - 29”  ELSEIF [Age] <= 39 THEN “30 - 39”  ELSEIF [Age] <= 49 THEN “40 - 49”  ELSEIF [Age] <= 59 THEN “50 - 59”  ELSEIF [Age] <= 69 THEN “60 - 69”  ELSEIF [Age] > 69 THEN “70 and above”  END \r\nCreate age bands for comparison\r\n4\r\nHousehold Size\r\nIF [Household Size] = 1 THEN “1 pax”  ELSEIF [Household Size] = 4 THEN “2 - 4 paxes”  ELSEIF [Household Size] <= 7 THEN “5 - 7 paxes”  ELSEIF [Household Size] = 8 THEN “8 or more paxes”  ELSEIF [Household Size] = 9 THEN “Don’t know”  ELSEIF [Household Size] = 10 THEN “Prefer not to say”  ELSE “Not answered” END \r\nCreate household size bands for comparison\r\n5\r\nEmployment Status Format\r\nIF [Employment Status 1] = “Yes” THEN “Full time employment”  ELSEIF [Employment Status 2] = “Yes” THEN “Part time employment”  ELSEIF [Employment Status 3] = “Yes” THEN “Full time student”  ELSEIF [Employment Status 4] = “Yes” THEN “Retired”  ELSEIF [Employment Status 5] = “Yes” THEN “Unemployed”  ELSEIF [Employment Status 6] = “Yes” THEN “Not working”  ELSEIF [Employment Status 7] = “Yes” THEN “Other”  ELSE [Employment Status] END \r\nStandardise format and recode all employment status into 1 consolidated field\r\nAs the data under the field of [Household Children] does not match with the codebook making it difficult to determine if the data captured are absolute quantitative responses or codes of qualitative responses, the field will not be used for subsequent visualisation steps\r\n3.3 Creating Diverging Stacked Bar Chart\r\nPivoting Data into Required Format\r\nOn Data Source tab, select the columns of the 6 data fields (Vac 1, Vac2_1, Vac2_2, Vac2_3, Vac2_6, Vac_3). Toggle to the top right of one of the selected column and click on the dropdown button. Select Pivot \r\nScroll to the pivoted resulting columns. Rename [Pivot Field Names] to “Question Code” and [Pivot Field Values] to “Question Response”\r\nCreating the Required Fields\r\nClick on Sheet 1 to add a new worksheet \r\nToggle to the pill of [Question Response] under the left Data pane and click on the dropdown button to the right of the pill. Select Aliases  Type the textual labels for the options under the “Value (Alias)” column and click OK. This helps to add proper text labels to the fields for display in the visulisation \r\nSeveral new calculated fields will be created for generating the diverging stacked bar chart. To create new field, click Analysis > Create Calculated Field. Rename the new field with text under “Field Name” column and input the formula under “Formula” column and click OK. Repeat this step for each of the new fields listed in the table below\r\nS/N\r\nField Name\r\nFormula\r\nPurpose\r\n1\r\nNumber of Records\r\n1\r\nCreate an artificial column on the count for ease of tabulation\r\n2\r\nTotal Count\r\nTOTAL(SUM([Number of Records]))\r\nCreate a total variable as the base\r\n3\r\nCount Negative\r\nIF [Question Response] = “5 – Strongly disagree” OR [Question Response] = “4” THEN 1  ELSEIF [Question Response] = “3” THEN 0.5  ELSE 0 END\r\nCalibrate the diverging scale\r\n4\r\nTotal Count Negative\r\nTOTAL(SUM([Count Negative]))\r\nCreate a total negative variable for generating starting point\r\n5\r\nPercentage\r\nSUM([Number of Records])/ [Total Count]\r\nCompute the percentages\r\n6\r\nGantt Start\r\n-[Total Count Negative]/ [Total Count]\r\nCreate a starting point for the gantt chart\r\n7\r\nGantt Percentage\r\nPREVIOUS_VALUE([Gantt Start]) + ZN(LOOKUP([Percentage], -1))\r\nCreate the percent for the gantt chart\r\nGenerating the Chart\r\nFrom the left Data pane, drag [Country Format] to Rows and [Gantt Percentage] under Columns \r\nDrag [Question Response] from the left Data pane to Detail under the Marks cart \r\nToggle to [Gantt Percentage] under Columns and click on the dropdown button to the right of the pill. Select Compute Using > Question Response \r\nDrag [Question Response] from the left Data pane to Color under the Marks cart \r\nUnder the Marks cart, click on the dropdown button and change the marks type to Gantt Bar \r\nDrag [Percentage] from the left Data pane to Size under the Marks cart \r\nClick on the dropdown button at the top right of the Legend of [Question Response] and select Sort. Under Sort By, select Manual from the list. Sort the labels using the arrows at the right into the order of Strongly disagree, Disagree, Neutral, Agree and Strongly agree \r\nUnder the left Data pane, right-click [Question Code], and select Create > Set \r\nUnder the popup “Create Set” window, check all options that should appear in the final filter card (i.e. Vac 1 and Vac 3). Rename the Set as Timeframe. Click OK \r\nDrag [Timeframe] to the Filter shelf \r\nToggle to [Timeframe] under Filter shelf and click on the dropdown button to the right of the pill. Select Show Filter \r\nClick on the dropdown button at the top right of the Timeframe Filter. Select Single Value (list) \r\nToggle to the pill of [Question Code] under the left Data pane and click on the dropdown button to the right of the pill. Select Aliases \r\nType the question labels for “Vac 1” as “This Week” and “Vac 3” as “A Year from Now” under the “Value (Alias)” column and click OK \r\nClick on the dropdown button at the top right of the Question Response Legend. Select Edit Colors. Change the colours of each category. The following colours were used for this dashboard: Strongly disagree – #aa0000; Disagree – #f5715d; Neutral – #b3b7b8; Agree – #92c0df; Strongly agree – #4e79a7 \r\nClick on the dropdown button at the top right of the Question Response Legend once more. Select Edit Title and change it to “Level of Agreement”\r\nRight click on the x-axis and select Add Reference Line\r\nIn the popup “Edit Reference Line, Band or Box” window, change the value to Constant and indicate 0. Change the label to None and make the preferred formatting for Line \r\nRight click on the x-axis again and untick Show Header to hide the x-axis\r\nRight click within the area of the chart and select Format. Click on the Lines button (fifth button on at the top). Under Rows tab, click on Grid Lines and format to own preference to show the horizontal lines. Under Columns tab, click None for Grid Lines \r\nDouble click on the sheet title and amend it. The following title and formatting was used. Click OK \r\nRight click on the Sheet 1 tab on the bottom bar and select Rename. Rename the sheet to “Diverging Chart”\r\nCreating a Dynamic Sorting Field\r\nIn the left Data pane, click the dropdown button at the top right corner and select Create Parameter \r\nIn the popup “Create Parameter” window, rename the parameter as “Sort Descending by”. Select Integer under the Data type and select List under Allowable values. Under the List of values, input the exact response label under Value and the corresponding textual label of Strongly disagree, Disagree, Neutral, Agree and Strongly agree under Display as. Click OK \r\nToggle to the parameter pill of [Sort Descending by] under the left Data pane and click on the dropdown button to the right of the pill. Select Show Parameter \r\nClick on the dropdown button at the top right of the Sort Descending by Parameter. Select Single Value (list)\r\nSeveral new calculated fields will be created for dynamic sorting. Click Analysis > Create Calculated Field. Rename the new field with text under “Field Name” column and input the formula under “Formula” column and click OK. Repeat this step for each of the new fields listed in the table below\r\nS/N\r\nField Name\r\nFormula\r\nPurpose\r\n1\r\nResponse Value\r\nIF [Question Response] = “5 – Strongly disagree” THEN 5  ELSEIF [Question Response] = “4” THEN 4  ELSEIF [Question Response] = “3” THEN 3  ELSEIF [Question Response] = “2” THEN 2  ELSEIF [Question Response] = “1 - Strongly agree” THEN 1 END \r\nAssign a numeric label for all responses for ease of computation\r\n2\r\nPercent Strongly Agree\r\nSUM(IF [Response Value] = 1 THEN 1 ELSE 0 END) / SUM([Number of Records])\r\nFor counting number of respondents that selected Strongly Agree\r\n3\r\nPercent Agree\r\nSUM(IF [Response Value] <= 2 THEN 1 ELSE 0 END) / SUM([Number of Records])\r\nFor counting number of respondents that selected Agree\r\n4\r\nPercent Neutral\r\nSUM(IF [Response Value] = 3 THEN 1 ELSE 0 END) / SUM([Number of Records])\r\nFor counting number of respondents that selected Neutral\r\n5\r\nPercent Disagree\r\nSUM(IF [Response Value] >= 4 THEN 1 ELSE 0 END) / SUM([Number of Records])\r\nFor counting number of respondents that selected Disagree\r\n6\r\nPercent Strongly Disagree\r\nSUM(IF [Response Value] = 5 THEN 1 ELSE 0 END) / SUM([Number of Records])\r\nFor counting number of respondents that selected Strongly Disagree\r\n7\r\nSort Order\r\nIF [Sort Descending by] = 1 THEN [Percent Strongly Agree]  ELSEIF [Sort Descending by] = 2 THEN [Percent Agree]  ELSEIF [Sort Descending by] = 4 THEN [Percent Disagree]  ELSEIF [Sort Descending by] = 5 THEN [Percent Strongly Disagree]  ELSE [Percent Neutral] END \r\nTo extract the relevant field based on selection in parameter\r\nToggle to [Country Format] under Rows and click on the dropdown button to the right of the pill. Select Sort. In the popup “Sort” window, select Nested under Sort By, Descending under Sort Order and Sort Order under Field Name. Keep Aggregation as Custom. Close the window \r\nCustomising the Tooltip\r\nClick on the Add New Worksheet button to the right of “Diverging Chart” worksheet\r\nFrom the left Data pane, drag [Question Response] to Rows and another [Question Response] under Columns \r\nToggle to [Question Response] under Columns and click on the dropdown button to the right of the pill. Select Measure > Count \r\nDrag [Question Response] from the left Data pane to Color under the Marks cart\r\nDrag [Number of Records] from the left Data pane to Label under the Marks cart. Toggle to [Number of Records] under Marks cart and click on the dropdown button to the right of the pill. Select Quick Table Calculation > Percent of Total. This is meant for the percentage label\r\nDrag another [Number of Records] from the left Data pane to Label under the Marks cart. This is meant for the count label \r\nClick on Label under the Marks cart then the button with 3 dots under Text. Format the label to own preference. In our case, the label was updated to <% of Total SUM(Number of Records)> (<SUM(Number of Records)>) and click OK \r\nToggle to [Number of Records] under Marks cart and click on the dropdown button to the right of the pill. Select Format. Under Pane tab, change the Numbers under Default section to Percentage with 1 decimal place \r\nToggle to [Question Response] under Rows and click on the dropdown button to the right of the pill. Select Sort. In the popup “Sort” window, select Manual under Sort By. Sort the labels using the arrows at the right into the order of Strongly Agree, Agree, Neutral, Disagree and Strongly disagree. Close the window \r\nRight click within the area of the chart and select Format. Click on the Lines button. Under Sheet tab, click on Grid Lines and select None\r\nRight click on the x-axis and untick Show Header to hide the x-axis\r\nRight click on the “Question Response” label just above the y-axis and select Hide Field Labels for Rows \r\nRight click on the Sheet 2 tab on the bottom bar and select Rename. Rename the sheet to “Tooltip”\r\nNavigate back to the “Diverging Chart” worksheet\r\nClick on Tooltip under the Marks cart. Edit the tooltip to keep the relevant content and amend the text where appropriate\r\nAdd the Tooltip chart by clicking on the Insert > Sheets > Tooltip. Amend the filter under the chart syntax in Tooltip from filter = “” to filter = “” \r\nNavigate back to the “Tooltip” worksheet and resize the chart by hovering along the bottom or right of the chart area until the resize arrow appears\r\n3.4 Creating a Dot Plot with Error Bars\r\nCreating the Required Fields\r\nClick on the Add New Worksheet button to the right of “Tooltip” worksheet\r\nSeveral new calculated fields will be created for plotting the error bars. Click Analysis > Create Calculated Field. Rename the new field with text under “Field Name” column and input the formula under “Formula” column and click OK. Repeat this step for each of the new fields listed in the table below. Some of the fields created earlier for the diverging chart will be reused\r\nS/N\r\nField Name\r\nFormula\r\nPurpose\r\n1\r\nProp_SE\r\n**SQRT(([Percent Strongly Agree]*(1-[Percent Strongly Agree]))/SUM([Number of Records]))**\r\nCompute the standard error proportion\r\n2\r\nZ_95%\r\n1.959964 \r\nZ-value for 95% confidence interval (CI)\r\n3\r\nZ_99%\r\n2.575829\r\nZ-value for 99% CI\r\n4\r\nProp_Margin of Error 95%\r\n**[Z_95%]*[Prop_SE]**\r\nCompute the margin of error for 95% CI\r\n5\r\nProp_Margin of Error 99%\r\n**[Z_99%]*[Prop_SE]**\r\nCompute the margin of error for 99% CI\r\n6\r\nProp_Lower Limit 95%\r\n[Percent Strongly Agree] - [Prop_Margin of Error 95%]\r\nLower limit of 95% CI\r\n7\r\nProp_Lower Limit 99%\r\n[Percent Strongly Agree] - [Prop_Margin of Error 99%]\r\nLower limit of 99% CI\r\n8\r\nProp_Upper Limit 95%\r\n[Percent Strongly Agree] + [Prop_Margin of Error 95%]\r\nUpper limit of 95% CI\r\n9\r\nProp_Upper Limit 99%\r\n[Percent Strongly Agree] + [Prop_Margin of Error 99%]\r\nUpper limit of 99% CI\r\nGenerating the Chart\r\nFrom the left Data pane, drag [Country Format] to Rows and [Percentage Strongly Agree] under Columns \r\nDrag [Measure Values] to Columns. Remove the unwanted measures and keep only Prop_Lower Limit 95%, Prop_Lower Limit 99%, Prop_Upper Limit 95% and Prop_Upper Limit 99% \r\nToggle to [Measure Values] under Columns and click on the dropdown button to the right of the pill. Select Dual Axis \r\nRight click on the bottom x-axis and select Synchronise Axis\r\nClick on the Measure Value Marks cart and change the Marks type to Line \r\nIn the Measure Value Marks cart, remove [Measure Names] from Detail. Drag [Measure Names] from the left Data pane to Path and another to Color \r\nClick on the dropdown button at the top right of the Measure Names Legend. Select Edit Colors. Change the colours of each category. The following colours were used for this dashboard: \r\nProp_Lower Limit 95% and Prop_Upper Limit 95% – #76b7b2; Prop_Lower Limit 99% and Prop_Upper Limit 99% – #afd6ed *\r\nReorganise the order of the dimensions under Columns to show the [Measure Values] before [Percent Strongly Agree] \r\nClick on the AGG(Percent Strongly Agree) Marks cart and change the Marks type to Circle. Click on colour to change it to the same colour as the Strongly Agree bar in the diverging stacked bar chart. Adjust the size of the dot to reduce it\r\nClick on the dropdown button at the top right of the Measure Names Legend. Select Sort. In the popup “Sort” window, select Manual under Sort By. Sort the labels using the arrows at the right into the order below. Close the window \r\nRight click on the top x-axis and uncheck Show Header\r\nRight click on the bottom x-axis and select Format. Under Axis tab, change the Numbers under Scale section to Percentage with 1 decimal place and Ticks to None \r\nToggle to [Country Format] under Rows and click on the dropdown button to the right of the pill. Select Sort. In the popup “Sort” window, select Nested under Sort By, Descending under Sort Order and Sort Order under Field Name. Keep Aggregation as Custom. Close the window\r\nRight click on the “Country Format” label just above the y-axis and select Hide Field Labels for Rows\r\nDouble click on the sheet title and amend it to “% Strongly Agree (95% and 99% Confidence Intervals)”. Click OK \r\nToggle to [AGG(Percent Strongly Agree)] under Columns and click on the dropdown button to the right of the pill. Select Format. Under Pane tab, change the Numbers under Scale section to Percentage with 1 decimal place\r\nRight click on the bottom x-axis and select Edit Axis. In the popup “Edit Axis” window, change the Axis Title to “% respondents”. Close the window \r\nRight click on the Sheet 3 tab on the bottom bar and select Rename. Rename the sheet to “Confidence Interval”\r\n3.5 Adding Dynamic Parameters\r\nNavigate back to “Diverging Chart” worksheet\r\nIn the left Data pane, click the dropdown button at the top right corner and select Create Parameter\r\nIn the popup “Create Parameter” window, rename the parameter as “Segment Selection”. Select String under the Data type and select List under Allowable values. Under the List of values, input the list of contextual fields as below. Click OK \r\nToggle to the parameter pill of [Segment Selection] under the left Data pane and click on the dropdown button to the right of the pill. Select Show Parameter\r\nClick on the dropdown button at the top right of the Segment Selection Parameter. Select Single Value (list) \r\nClick Analysis > Create Calculated Field. Rename the new field as “Selected” and input the formula below then click OK CASE [Segment Selection]  WHEN “Overall” THEN \"\"  WHEN “Gender” THEN [Gender]  WHEN “Age” THEN [Age Band]  WHEN “Household Size” THEN [Household Size Band]  WHEN “Employment Status” THEN [Employment Status Format]  END \r\nDrag [Selected] under Filter shelf. In the popup “Filter” window, tick the shown text and select All. Click OK\r\nToggle to [Selected] under Filter shelf and click on the dropdown button to the right of the pill. Select Show Filter\r\nClick on the dropdown button at the top right of the Selected Filter. Select Single Value (list)\r\n3.6 Creating Similar Charts for Other Fields\r\nDuplicating the Diverging Stacked Bar Chart\r\nDuplicate the “Diverging Chart” worksheet\r\nRemove Timeframe set from the Filters shelf\r\nUnder the left Data pane, right-click [Question Code], and select Create > Set\r\nIn the popup “Create Set” window, check all options that should appear in the final filter card (i.e. Vac 2_1, Vac 2_2, Vac 2_3 and Vac 2_6). Rename the Set as Other Findings. Click OK \r\nDrag [Other Findings] to the Filter shelf\r\nToggle to [Other Findings] under Filter shelf and click on the dropdown button to the right of the pill. Select Show Filter\r\nClick on the dropdown button at the top right of the Other Findings Filter. Select Single Value (dropdown)\r\nToggle to the pill of [Question Code] under the left Data pane and click on the dropdown button to the right of the pill. Select Aliases\r\nType the question phrasing for Vac 2_1, Vac 2_2, Vac 2_3 and Vac 2_6 under the “Value (Alias)” column and click OK\r\nMember\r\nValue (Alias)\r\nVac2_1\r\nI am worried about getting Covid-19\r\nVac2_2\r\nI am worried about potential side effects of a Covid-19 vaccine\r\nVac2_3\r\nI believe government health authorities in my country will provide me with an effective Covid-19 vaccine\r\nVac2_6\r\nIf I do not get a Covid-19 vaccine when it is available, I will regret it\r\nDouble click the sheet title and reset it back to Sheet Name using the Insert button\r\nRight click on the sheet tab on the bottom bar and select Rename. Rename the sheet to “Diverging - Oth”\r\nDuplicating the Dot Plot with Error Bars\r\nDuplicate the “Confidence Interval” worksheet\r\nRight click on the sheet tab on the bottom bar and select Rename. Rename the sheet to “CI - Oth”\r\n4.0 Final Data Visualisation Output\r\n\r\n\r\n\r\nLink to Tableau Dashboard:\r\n5.0 Major Observations\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-12-dataviz-makeover-2/images/Fig1_ExistingViz.png",
    "last_modified": "2021-02-19T03:14:28+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-01-26-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "A makeover of the data visualisation on Resident Labour Force. The original data visualisation can be found on Page 22 of Report: Labour Force in Singapore 2019 (https://stats.mom.gov.sg/Pages/Labour-Force-In-Singapore-2019.aspx).",
    "author": [
      {
        "name": "Selene Choong",
        "url": "https://www.linkedin.com/in/selenechoong/"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\r\n1.0 Critiques of Existing Visualisation with Suggested Improvements\r\n\r\n\r\n\r\nClarity\r\nS/N\r\nComments\r\nSuggested Improvement\r\n1\r\nLead-in paragraph is informative and discusses about both the change in the Labour Force Participation Rate (LFPR) and in the share of the resident labour force by age groups from 2009 to 2019. However, the current chart only shows the share of the resident labour force by age groups. No data is shown to depict the change in the LFPR, which might confuse the readers on the data being referenced in the analysis.\r\nInclude another additional chart that shows the corresponding LFPR by age bands for 2009 and 2019\r\n2\r\nLead-in paragraph cites the percentages as the sum of broader age bands (e.g. aged 25 to 54 instead of the 5-year age band of 25-29, 30-34 to 50-54) making it difficult for the readers to relate the figures with the chart directly.\r\nAnnotate within the chart the total percentages across the age bands that were being mentioned in the lead-in paragraph so that readers can easily identify how the percentages cited were derived\r\n3\r\nTitle of the existing chart might be confusing as “Resident labour force by age” might be interpreted as the actual number of residents that are in the labour force for each age band but the current unit for the chart is in percent.\r\nRevise the chart title to “Share of Resident Labour Force by Age” to reflect that the figures shown are percentages and total across all age groups will sum to 100%\r\n4\r\nData are being represented in age bands on the x-axis. Using line chart makes it difficult for readers to identify the corresponding points for age group on the x-axis. Also, the use of line chart might mislead the reader to interpret the data as being time-series data. Line charts are not advisable to be used for comparison of categorical data.\r\nRevise the chart to represent each age band as a bar chart (horizontal/ vertical) to clearly show that age is being charted as discrete categorical bands instead of continuous age value\r\n5\r\nWhile having the reference line for the median age is useful for comparing between the 2 years, charting it on the x-axis which is shown in terms of age bands is confusing.\r\nKeep the median age comparison but as a separate chart instead of reference levels\r\nAesthetics\r\nS/N\r\nComments\r\nSuggested Improvement\r\n6\r\nChoice of font, font size and layout is generally clear with the title of the chart at the top left corner of the chart. Labels on x-axis are clearly displayed horizontally.\r\nCan keep to the existing font, font size and layout\r\n7\r\nThe use of colour coding (grey for 2009 and blue for 2019) helps readers to easily distinguish the data between the 2 years. The more recent year of 2019 also stands out since the blue colour used is brighter.\r\nTwo distinct colours can still be used for each year to distinguish between them\r\n8\r\nThere is currently no y-axis and no indication of the data units being shown in the line chart. It might not be clear to the readers what data are being represented by the 2 lines in the chart.\r\nAdd the necessary labelling for the axis to allow readers to clearly identify the data that is being charted\r\n2.0 Ways to Improve Current Visualisation\r\nSketch of Proposed Design\r\n\r\n\r\n\r\nThe usage of bar charts instead of line charts can better represent the data which was grouped into categorical age bands. Presentation of the data in sequential age bands of around 5 years was kept which allows readers to see the differences across the age groups on a more detailed level.\r\nAddition of the chart on the Labour Force Participation Rate (LFPR) as well as the net percentages across age bands for the share of Labour Force allows for consistency in the information described in the lead-in paragraph and the charts, where readers can easily identify the source of the data in the visualisation.\r\nHaving the two charts with the corresponding age bands side-by-side allows the readers to easily see how the share and the LFPR has changed for each age band and compare across the age bands.\r\nSeparating the median age from the chart also prevents confusion since the age data was not being shown as a continuous variable.\r\n3.0 Step-by-step Description on Preparation\r\nS/N\r\nInterface\r\nStep\r\nAction\r\n1\r\nExcel Tables\r\nData preparation - Extract relevant data and format into proper structure\r\nPerform the following steps for Table 5 and Table 7:  • Extract data from the Total tab, keeping only column data for 2009 and 2019 as well as row data for the header and the individual age bands (i.e. rows 5, 7 to 18)  • Format the structure to remove all the leading empty rows (i.e. header to start at row 1) and all the empty columns so that the data is in the correct format for importing into Tableau  Save the extracted data into a new excel file with one table on each worksheet tab\r\n2\r\nExcel Tables\r\nData preparation - Format row labels\r\nRemove the extra white spaces in the age labels (e.g. from “15 - 19” to “15 - 19”)\r\n3\r\nData Source\r\nImport data into Tableau\r\n• Under Connect to a File, click Microsoft Excel and select the relevant excel file from the correct directory  • Relate Table 5 and Table 7 using the common variable of Age (Years) \r\n4\r\nSheet 1 (LF_Share)\r\nCreate pyramid chart for Share of Resident Labour Force by Age\r\nDrag T7 Age under Rows, T7 2009 and T7 2019 under Columns \r\n5\r\nSheet 1 (LF_Share)\r\nConvert the measures into percent\r\nUse quick table calculations and convert both T7 2009 and T7 2019 to percent of total (i.e. value shown in the original chart)\r\n6\r\nSheet 1 (LF_Share)\r\nFormat the charts\r\n• Edit the x-axis of the 2009 chart and select “Reversed” to reverse the axis of the chart on the left  • Click on Label and select “Show marks labels” to add the chart labels for both 2009 and 2019 charts  • Format the measures to display them to 1 decimal place by changing the “Numbers” under Default section of the Pane tab to Percentages 1 decimal place  • Right click on the x-axis and select Edit Axis. Fix the range to have a consistent range for both left and right charts  • Colour code the 2 charts into 2 different colours by year using the Colour button under the Marks cart  • Remove the vertical gridlines under Format Lines by changing the “Grid Lines” of the Column tab to None  • Edit the Tooltip under the Marks cart for the label of the % to “% out of Total in [YYYY]” \r\n7\r\nSheet 1 (LF_Share)\r\nFormat the charts – Add the x-axis at the top of the chart\r\n• Drag another T7 2009 (after the current T7 2009) and T7 2019 (after the current T7 2019) under Columns  • Change the chart type back to Bar for all charts  • Use quick table calculations and convert the new T7 2009 and T7 2019 to percent of total  • For each of the new measure added, click on the arrow and select “Dual Axis” to merge the charts of the same measure as one  • Change the colour of the charts for the two new measures to Opacity = 0% under their corresponding Marks cart  • Right click on the x-axis at the top and select “Synchronize Axis”  • “Remove” the bottom x-axis for both charts by selecting Edit Axis then clear the Title text box under Titles and select None for both Major tick marks and Minor tick marks under the Tick Marks tab  • Change the top x-axis to show only the label of “% in June [YYYY]” by selecting Edit Axis then revise the Title text box under Titles and select None for both Major tick marks and Minor tick marks under the Tick Marks tab\r\n8\r\nSheet 1 (LF_Share)\r\nAdd chart title\r\nTitle of the chart was changed to “Share of Resident Labour Force by Age” with the unit of Per cent added below by clicking on the Title to edit\r\n9\r\nData Source\r\nTransform data into required format\r\n• Pivot the columns T5 2009 and T5 2019  • Rename “Pivot Field Names” to “Year”, “Pivot Field Values” to “LFPR”\r\n10\r\nSheet 2 (LFPR)\r\nCreate dumbbell chart for LFPR by Age\r\n• Drag T5 Age under Rows, LFPR under Columns and Year under Colour  • Change the mark type from Automatic to Circle  • Drag another LFPR under Columns and change the mark type to Line  • Remove Year from Colour and drag it to Path \r\n11\r\nSheet 2 (LFPR)\r\nFormat the chart\r\n• Right click on the second pill of LFPR and select “Dual Axis”  • Right click on one of the x-axis and select “Synchronise Axis”  • Swop the order of the two LFPR pills such that the line appears behind the dots  • Rename the bottom x-axis to “% LFPR”  • Hide the top x-axis by right clicking the x-axis and unselecting “Show Header”  • Colour code the dots for the 2 years into the 2 corresponding colours used in the previous chart in Sheet 1  • Increase the size of the dots and the thickness of the line \r\n12\r\nSheet 2 (LFPR)\r\nAdd Chart Title\r\nTitle of the chart was changed to “Resident Labour Force Participation Rate by Age” with the unit of Per cent added below by clicking on the Title to edit\r\n13\r\nSheet 3 (LF_Nett)\r\nCreate new calculated field with recoded age bands\r\nRecode the age into broader age bands using “Create Calculated Fields…” and input the details below \r\n14\r\nSheet 3 (LF_Nett)\r\nCreate table with Share of Resident Labour Force by broader age bands\r\n• Drag Age_Nett under Rows, Measure Names under Columns and Measure Values under Text  • Remove the irrelevant measures under Measure Values to keep only T7 2009 and T7 2019  • Use quick table calculations and convert both T7 2009 and T7 2019 under Measure Values to percent of total\r\n15\r\nSheet 3 (LF_Nett)\r\nFormat the table\r\n• Right click on the header and unselect “Show Header”  • Right click on the header of the rows and select “Hide Field Labels for Rows”  • Click on the arrow for each measure under Measure Values and format to display them to 1 decimal place by changing the “Numbers” under Default section of the Pane tab to Percentages 1 decimal place  • Right click on the table and add table border under the Format Border  • Rearrange the rows in ascending age order by dragging the rows to the correct position\r\n16\r\nDashboard\r\nCreate the Dashboard, Add Title and Format\r\n• Create a new dashboard sheet. Drag LF_Share and LFPR from the Sheets cart into the dashboard sheet to be displayed side by side. Drag LF_Nett under the LF_Share chart  • Select “Show Title” under Dashboard. Title of the dashboard was changed to “Increase in older residents in the labour force from 2009 to 2019”, with the year colour coded  • Add in a text box under the Title to add in the lead-in paragraph\r\n17\r\nDashboard\r\nFormat the Legend\r\n• Rearrange the legend to display it under the LFPR chart  • Right click on each legend and click “Edit Alias” to rename each legend label to “June [YYYY]”  • Click more options on the left of the Legend, select “Arrange items” and Single Row  • Add a Blank to the left of the Legend to right align the Legend relative to the LFPR chart\r\n18\r\nDashboard\r\nAdd in the median ages\r\n• Add in the median ages for 2009 and 2019 with the label of Median Age as separate text boxes under the LFPR_Nett table  • Colour code the median ages by the year\r\n19\r\nData Source\r\nPublish onto Tableau Public\r\nConvert the connection from Live to Extract to allow publishing to Tableau Public \r\n4.0 Final Data Visualisation Output\r\n\r\n\r\n\r\nLink to Tableau Dashboard: https://public.tableau.com/profile/selenechoong#!/vizhome/ISSS608_DataViz_Makeover_01/Dashboard\r\n5.0 Major Observations\r\nObservation 1:  Between 2009 to 2019, share of the middle-aged residents (aged 25 - 54) among the resident labour force has declined (75.3% in 2009 to 67.4% in 2019), despite the increase in Labour Force Participation Rate (LFPR) among these middle-aged residents.\r\n\r\n\r\n\r\nObservation 2:  While LFPR remained lower among older residents (aged 55 & over) as compared to the middle-aged residents (aged 25 - 54) in 2019, there was a larger increase in LFPR observed among these older residents between 2009 to 2019, particularly among those aged 60 to 69 with more than 10% point increase.\r\n\r\n\r\n\r\nObservation 3:  All age bands experienced a rise in the LFPR between 2009 to 2019, except for residents aged 20 to 24 where LFPR has declined from 63.5% to 61.0%.\r\n\r\n\r\n\r\nObservation 4:  Distribution of the resident labour force used to be more right skewed in 2009 (i.e. younger labour force) as compared to 2019, where the distribution of the resident labour force appears to be more symmetric. This is further supported by the increase in median age of the residents in the labour force.\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-26-dataviz-makeover-1/images/Fig1_ExistingViz.png",
    "last_modified": "2021-02-12T16:46:04+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Visual Analytics",
    "description": "Welcome to my blog documenting all my works for ISSS608 Visual Analytics \n& Applications. I hope you enjoy reading what I have created!",
    "author": [
      {
        "name": "Selene Choong",
        "url": "https://www.linkedin.com/in/selenechoong/"
      }
    ],
    "date": "2021-01-18",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-12T16:43:44+08:00",
    "input_file": "welcome.utf8.md"
  }
]
